# 15. Написать программу, которая по заданным значениям чисел a и b находит
# a в степени b. В запросе укажите допустимые значения этих переменных(
# Например если а - дробное, то b не может быть отрицательным).
a = int(input(":"))
b = int(input(":"))

print(a**b)
