# 21. Дано натуральное n. вычислить 1/(2 в квадрате) + 1/(4 в квадрате)+ ... +
# 1/(2n в квадрате) ( в квадрате только n)
n = int(input(":"))
s = 0
for i in range(1,n+1):
    s += 1/(2*i**2)
print(s)
