# 29. с помощью оператора while напишите программу вывода всех четных
# чисел в диапазоне от 2 до 100 включительно.
i = 2
while i<101:
    if i%2 == 0:
        print(i)
    i+=1
